/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ykosebas <ykosebas@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/01/17 12:50:39 by ykosebas          #+#    #+#             */
/*   Updated: 2026/01/19 15:52:54 by ykosebas         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//libft.h olmamalıymış normit hatasıymış
int ft_tolower(int c)
{
    if ('A' <= c && c <= 'Z')
        return (c + 32);
    else
        return (c);
}